In [2]:
%%capture
%load_ext sql
%sql sqlite:///factbook.db

In [3]:
%%sql

SELECT *

FROM facts
LIMIT 2;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3)]

In [4]:
%%sql
SELECT *
    FROM sqlite_master
WHERE type='table';

 * sqlite:///factbook.db
Done.

[('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'),
 ('table', 'facts', 'facts', 47, 'CREATE TABLE "facts" ("id" INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL, "code" varchar(255) NOT NULL, "name" varchar(255) NOT NULL, "area" integer, "a ... (4 characters truncated) ... land" integer, "area_water" integer, "population" integer, "population_growth" float, "birth_rate" float, "death_rate" float, "migration_rate" float)'),
 ('table', 'cities', 'cities', 2, 'CREATE TABLE cities (\n        id integer primary key,\n        name text,\n        population integer,\n        capital bool,\n        facts_id text,\n        foreign key(facts_id) references facts(id)\n    )')]

In [5]:
%%sql 
SELECT *
FROM facts
LIMIT 5;

 * sqlite:///factbook.db
Done.

[(1, 'af', 'Afghanistan', 652230, 652230, 0, 32564342, 2.32, 38.57, 13.89, 1.51),
 (2, 'al', 'Albania', 28748, 27398, 1350, 3029278, 0.3, 12.92, 6.58, 3.3),
 (3, 'ag', 'Algeria', 2381741, 2381741, 0, 39542166, 1.84, 23.67, 4.31, 0.92),
 (4, 'an', 'Andorra', 468, 468, 0, 85580, 0.12, 8.13, 6.96, 0.0),
 (5, 'ao', 'Angola', 1246700, 1246700, 0, 19625353, 2.78, 38.78, 11.49, 0.46)]

In [8]:
%%sql
/*Write a single query that returns the:

Minimum population
Maximum population
Minimum population growth
Maximum population growth*/




SELECT MIN(population), MAX(population),
MIN(population_growth), MAX(population_growth)

FROM facts;

 * sqlite:///factbook.db
Done.

[(0, 7256490011, 0.0, 4.02)]

In [9]:
%%sql

/*Write a query
that returns the countrie(s) with the minimum population*/



SELECT name
FROM facts
WHERE population = ( SELECT MIN(population) FROM facts)

 * sqlite:///factbook.db
Done.

[('Antarctica',)]

In [10]:
%%sql

/*Write a query that returns the
countrie(s) with the maximum population.*/




SELECT name
FROM facts
WHERE population = ( SELECT MAX(population) FROM facts)

 * sqlite:///factbook.db
Done.

[('World',)]

In [11]:
%%sql

/*Recompute the summary statistics you found earlier while excluding the row for the whole world. They were:

Minimum population
Maximum population
Minimum population growth
Maximum population growth*/


SELECT MIN(population), MAX(population),
MIN(population_growth), MAX(population_growth)

FROM facts
WHERE name NOT IN ('World', 'Antarctica') ;

 * sqlite:///factbook.db
Done.

[(48, 1367485388, 0.0, 4.02)]

In [12]:
%%sql

/*In a different code cell, 
calculate the average value for the following columns:
population
area*/



SELECT AVG(population), AVG(area)
FROM facts;

 * sqlite:///factbook.db
Done.

[(62094928.32231405, 555093.546184739)]

In [13]:
%%sql

/*Write a query that finds all 
countries meeting both of the following conditions:
The population is above average.
The area is below average.*/
 

SELECT name
FROM facts
WHERE population > (SELECT AVG(population) FROM facts) AND
area< (SELECT AVG(area) FROM facts)

 * sqlite:///factbook.db
Done.

[('Bangladesh',),
 ('Germany',),
 ('Japan',),
 ('Philippines',),
 ('Thailand',),
 ('United Kingdom',),
 ('Vietnam',)]

In [19]:
%%sql

/*What country has the most people? */

SELECT name, population
FROM facts
WHERE name NOT IN ('World')
ORDER BY population DESC
LIMIT 3;

 * sqlite:///factbook.db
Done.

[('China', 1367485388), ('India', 1251695584), ('European Union', 513949445)]

In [20]:
%%sql

/*What country has the highest growth rate?*/

SELECT name, population,population_growth
FROM facts
WHERE name NOT IN ('World')
ORDER BY population_growth DESC
LIMIT 3;

 * sqlite:///factbook.db
Done.

[('South Sudan', 12042910, 4.02),
 ('Malawi', 17964697, 3.32),
 ('Burundi', 10742276, 3.28)]

In [23]:
%%sql

/*Which countries have the highest ratios of water to land?*/

SELECT name, CAST(area_water AS FLOAT)/ area_land as ratio_water_land
FROM facts
WHERE name NOT IN ('World', 'Antarctica')
ORDER BY ratio_water_land DESC
LIMIT 3;

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory', 905.6666666666666),
 ('Virgin Islands', 4.520231213872832),
 ('Puerto Rico', 0.5547914317925592)]

In [26]:
%%sql

/*Which countries have more water than land?*/

SELECT name
FROM facts
WHERE area_water>area_land

 * sqlite:///factbook.db
Done.

[('British Indian Ocean Territory',), ('Virgin Islands',)]

In [ ]:
name NOT IN ('World','Antarctica') AND 
ORDER BY ratio_water_land DESC

In [26]:

%%sql

SELECT name
FROM facts
WHERE name NOT IN ('World') AND population=(SELECT MAX(population)
                                           FROM facts
                                           )

Done.

[('World',)]

In [27]:
%%sql

SELECT name
FROM facts
WHERE  population=(SELECT MAX(population)
        FROM facts  )
EXCEPT
SELECT name
FROM facts
WHERE name NOT IN ('World')

Done.

[('World',)]

In [ ]:
SELECT JobTitle
FROM   HumanResources.Employee
WHERE  Gender = 'M'
EXCEPT
SELECT JobTitle
FROM   HumanResources.Employee
WHERE  Gender = 'F'

In [ ]:
'''What country has the most people? What country has the highest growth rate?
Which countries have the highest ratios of water to land? Which countries have more water than land?
Which countries will add the most people to their population next year?
Which countries have a higher death rate than birth rate?
What countries have the highest population/area ratio and how does it compare to list we found in the previous screen?'''